# Built In Failures Rebar Failures Crank Doesnt Fit Segment Property

Source: https://www.revitapidocs.com/2026/56b4873a-b355-269a-699b-f4c80c8d0be8.htm

---

| Built In Failures Rebar Failures Crank Doesnt Fit Segment Property |
| --- |

Curves are too small to fit the Rebar Shape with Crank.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId CrankDoesntFitSegment { get; }
```

```
Public Shared ReadOnly Property CrankDoesntFitSegment As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ CrankDoesntFitSegment {
	FailureDefinitionId^ get ();
}
```

```
static member CrankDoesntFitSegment : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace